# SpacingLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpacingLength Property
ParameterTypeId Class See Also
---
"Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpacingLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpacingLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpacingLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace